In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "Name": ["Gaurav", "Sharan", None, "Rajesh", "Priya", None, "Vikram", "Anjali", "Arjun", None],
    "Department": ["Sales", None, "IT", "HR", None, "Finance", "Sales", "IT", None, "HR"],
    "Role": ["Manager", "Executive", None, "Lead", "Developer", "Analyst", None, "Designer", "Engineer", "Coordinator"],
    "Experience": [5, 3, None, 7, 2, 4, None, 6, 8, 1],
    "Salary": [50000, 35000, None, 60000, 40000, 45000, None, 48000, 55000, 32000],
    "Score": [8.5, 7.2, None, 9.1, 6.8, 7.9, None, 8.3, 9.0, 6.5]
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        7 non-null      object
 1   Department  7 non-null      object
 2   Role        8 non-null      object
 3   Experience  8 non-null      float64
 4   Salary      8 non-null      float64
 5   Score       8 non-null      float64
dtypes: float64(3), object(3)
memory usage: 612.0+ bytes

What is average mean salary for each department

What is average mean performance score for each role

In [8]:
df.groupby('Department')['Salary'].mean()

Department
Finance    45000.0
HR         46000.0
IT         48000.0
Sales      50000.0
Name: Salary, dtype: float64

In [9]:
df.groupby('Role')['Score'].mean()

Role
Analyst        7.9
Coordinator    6.5
Designer       8.3
Developer      6.8
Engineer       9.0
Executive      7.2
Lead           9.1
Manager        8.5
Name: Score, dtype: float64

Counting and sizing

how many actual non null performance score entries exist for each department

total number of employee records(rows)in each department,regardless of whether data is missing

In [10]:
df.groupby('Department')['Score'].count()

Department
Finance    1
HR         2
IT         1
Sales      1
Name: Score, dtype: int64

In [15]:
df.groupby('Department').count()

            Name  Role  Experience  Salary  Score
Department
Finance        0     1           1       1      1
HR             1     2           2       2      2
IT             1     1           1       1      1
Sales          2     1           1       1      1

In [16]:
df.groupby('Department').size()

Department
Finance    1
HR         2
IT         2
Sales      2
dtype: int64

Multiple Aggregation

In [18]:
df.groupby('Department')['Salary'].agg(['mean','max','min','count'])

               mean      max      min  count
Department
Finance     45000.0  45000.0  45000.0      1
HR          46000.0  60000.0  32000.0      2
IT          48000.0  48000.0  48000.0      1
Sales       50000.0  50000.0  50000.0      1

In [19]:
df.groupby('Role')['Score'].agg(['mean','max','min','count'])

             mean  max  min  count
Role
Analyst       7.9  7.9  7.9      1
Coordinator   6.5  6.5  6.5      1
Designer      8.3  8.3  8.3      1
Developer     6.8  6.8  6.8      1
Engineer      9.0  9.0  9.0      1
Executive     7.2  7.2  7.2      1
Lead          9.1  9.1  9.1      1
Manager       8.5  8.5  8.5      1

Grouping by multiple columns

find avg salary of both grouped department and role

find avg score grouped by both department and experiene level

In [20]:
df.groupby(['Department','Role'])['Salary'].mean()

Department  Role
Finance     Analyst        45000.0
HR          Coordinator    32000.0
            Lead           60000.0
IT          Designer       48000.0
Sales       Manager        50000.0
Name: Salary, dtype: float64

In [21]:
df.groupby(['Department','Experience'])['Score'].mean()

Department  Experience
Finance     4.0           7.9
HR          1.0           6.5
            7.0           9.1
IT          6.0           8.3
Sales       5.0           8.5
Name: Score, dtype: float64